_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_НакоплениеИнвестиционногоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_НакоплениеИнвестиционногоНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УСОERP_ИнвестиционныйНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслугДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТМЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТМЦДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_НакоплениеИнвестиционногоНДС/Forms/Форма/Ext/Form/Module.bsl
//--------------------------------------------------------------------------
// {УСО 2.0}:{Управление строительным предприятием} Гнатишин М.І. ПОЧАТОК

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы документа.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.ОтчетныйПериод = ТекущаяДатаСеанса();
	Объект.Организация	  = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Объект.Организация);
	Объект.Ответственный  = Пользователи.ТекущийПользователь();

	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, "ОтчетныйПериодСтрокой", ПолучитьПредставлениеМесяца(Объект.ОтчетныйПериод));	
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере" формы документа.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, "ОтчетныйПериодСтрокой", ПолучитьПредставлениеМесяца(Объект.ОтчетныйПериод));	
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля ввода представления периода.
//
Процедура ОтчетныйПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ОтчетныйПериод",	"ОтчетныйПериодСтрокой");

КонецПроцедуры // ОтчетныйПериодСтрокойНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "Регулирование" поля ввода представления периода.
//
Процедура ОтчетныйПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ВводМесяцаРегулирование(ЭтаФорма, "Объект.ОтчетныйПериод", "ОтчетныйПериодСтрокой",	Направление);

КонецПроцедуры // ОтчетныйПериодСтрокойРегулирование()

&НаКлиенте
// Процедура - обработчик события "Очистка" поля ввода представления периода.
//
Процедура ОтчетныйПериодСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ОтчетныйПериодСтрокойОчистка()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода комментария.
//
Процедура КомментарийПриИзменении(Элемент)
	
	КомментарийПриИзмененииНаСервере();
	
КонецПроцедуры // КомментарийПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды заполнения табл. части "Объекты строительства".
//
Процедура ЗаполнитьДаннымиОбработку(Команда)

	Если Не Объект.ОбъектыСтроительства.Количество() = 0 Тогда

		ТекстВопроса = НСтр("ru='Перед заполнением табл. часть ""Объекты строительства"" будет очищена. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДаннымиОбработкуЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);

		Возврат;

	КонецЕсли;

	ЗаполнитьДаннымиОбработкуНаСервере();
	
КонецПроцедуры // ЗаполнитьДаннымиОбработку()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды заполнения табл. части "Объекты строительства".
//
Процедура ЗаполнитьДаннымиОбработкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаполнитьДаннымиОбработкуНаСервере();

КонецПроцедуры // ЗаполнитьДаннымиОбработкуЗавершение()

&НаКлиенте
// Процедура - обработчик события "Нажатие" команды создания документов "Инвестиционный НДС".
//
Процедура СоздатьДокументыИнвестиционныйНДС(Команда)
	
	ТекстВопроса = НСтр("ru='Для всех строк табл. части будут созданы/перезаполнены документы ""Инвестиционный НДС"". Продолжить?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьДокументыИнвестиционныйНДСЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // СоздатьДокументыИнвестиционныйНДС()

&НаКлиенте
// Завершение процедуры - обработчика события "Нажатие" команды создания документов "Инвестиционный НДС".
//
Процедура СоздатьДокументыИнвестиционныйНДСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;

	СоздатьДокументыИнвестиционныйНДСНаСервере();

КонецПроцедуры // СоздатьДокументыИнвестиционныйНДСЗавершение()

#КонецОбласти

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
// Функция формирует представление месяца по дате начала месяца и возвращает полученное значение.
//
Функция ПолучитьПредставлениеМесяца(Знач ДатаНачалаМесяца)
	
	Возврат Формат(ДатаНачалаМесяца, "ДФ='ММММ гггг'");
	
КонецФункции // ПолучитьПредставлениеМесяца()

&НаКлиенте
// Процедура формирует необходимые параметры/значения и вызывает общую форму для ввода месяца "Выбор периода".
//
Процедура ВводМесяцаНачалоВыбора(Форма, РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма"					  , Форма);
	ДополнительныеПараметры.Вставить("РедактируемыйОбъект"		  , РедактируемыйОбъект);
	ДополнительныеПараметры.Вставить("ПутьРеквизита"			  , ПутьРеквизита);
	ДополнительныеПараметры.Вставить("ПутьРеквизитаПредставления" , ПутьРеквизитаПредставления);
	
	Значение			= ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	Оповещение			= Новый ОписаниеОповещения("ВводМесяцаНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СтруктураПараметров	= Новый Структура("Значение, РежимВыбораПериода, ЗапрашиватьРежимВыбораПериодаУВладельца", Значение, "Месяц", Ложь);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", СтруктураПараметров, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ВводМесяцаНачалоВыбора()

&НаКлиенте
// Процедура завершает заполнение текущего объекта после закрытия общей формы для ввода месяца "Выбор периода".
//
Процедура ВводМесяцаНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Форма					   = ДополнительныеПараметры.Форма;
	РедактируемыйОбъект		   = ДополнительныеПараметры.РедактируемыйОбъект;
	ПутьРеквизита			   = ДополнительныеПараметры.ПутьРеквизита;
	ПутьРеквизитаПредставления = ДополнительныеПараметры.ПутьРеквизитаПредставления;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Значение = ВыбранноеЗначение;
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита, Значение);
	Представление = ПолучитьПредставлениеМесяца(Значение);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, Представление);
	
КонецПроцедуры // ВводМесяцаНачалоВыбораЗавершение()

&НаКлиенте
// Процедура выполняет регулирование представления и значения месяца в выбранном на форме пользователем направлении.
//
Процедура ВводМесяцаРегулирование(РедактируемыйОбъект, ПутьРеквизита, ПутьРеквизитаПредставления, Направление)
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита);
	Значение = ДобавитьМесяц(Значение, Направление);
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизита, Значение);
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(РедактируемыйОбъект, ПутьРеквизитаПредставления, ПолучитьПредставлениеМесяца(Значение));

КонецПроцедуры // ВводМесяцаРегулирование()

&НаСервере
// Серверная процедура - обработчик события "ПриИзменении" поля ввода комментария.
//
Процедура КомментарийПриИзмененииНаСервере()

	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);

КонецПроцедуры // КомментарийПриИзмененииНаСервере()

&НаСервере
// Процедура формирует структуру параметров и вызывает функцию заполнения табл. части "Объекты строительства". 
//
Процедура ЗаполнитьДаннымиОбработкуНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"				 , НачалоМесяца(Объект.ОтчетныйПериод));
	СтруктураПараметров.Вставить("ОкончаниеПериода"				 , КонецМесяца(Объект.ОтчетныйПериод));
	СтруктураПараметров.Вставить("Организация"					 , Объект.Организация);
	СтруктураПараметров.Вставить("ОбъектСтроительства"			 , Неопределено);
	СтруктураПараметров.Вставить("НакоплениеНДСПоРаботамУслугам" , УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоРаботамУслугам(СтруктураПараметров)); 
	СтруктураПараметров.Вставить("НакоплениеНДСПоМатериалам"	 , УСОERP_ДолевоеСтроительствоСервер.ПолучитьДанныеНакопленияНДСПоМатериалам(СтруктураПараметров));
	
	//Объект.ОбъектыСтроительства.Загрузить(Обработки.УСОERP_НакоплениеИнвестиционногоНДС.ПолучитьДанныеЗаполненияПоОбъектамСтроительства(СтруктураПараметров));
	Объект.ОбъектыСтроительства.Загрузить(РеквизитФормыВЗначение("Объект").ПолучитьДанныеЗаполненияПоОбъектамСтроительства(СтруктураПараметров));
КонецПроцедуры // ЗаполнитьДаннымиОбработкуНаСервере()

&НаСервере
// Процедура для каждой строки табл. части "Объекты строительства" формирует документ "Инвестиционный НДС".
//
Процедура СоздатьДокументыИнвестиционныйНДСНаСервере()

	Для Каждого СтрокаТаблицы Из Объект.ОбъектыСтроительства Цикл
		Обработки.УСОERP_НакоплениеИнвестиционногоНДС.Создать().СоздатьДокументИнвестиционныйНДСПоОбъектуСтроительства(Объект, СтрокаТаблицы);
		РеквизитФормыВЗначение("Объект").СоздатьДокументИнвестиционныйНДСПоОбъектуСтроительства(Объект, СтрокаТаблицы);
	КонецЦикла;	
	
КонецПроцедуры // СоздатьДокументыИнвестиционныйНДСНаСервере()

#КонецОбласти

// {УСО 2.0}:{Управление строительным предприятием} Гнатишин М.І. КІНЕЦЬ
//--------------------------------------------------------------------------
